name = input("Введите ваше имя: ")
surname = input("Введите вашу фамилию: ")
year = input("Введите год рождения: ")
year = 2023 - int(year)

print(name, surname + ",", year)


# ДОБАВИТЬ: результат ВЫПОЛНЕНИЯ программы с собственными данными, например:
# Введите ваше имя: Геннадий
# Введите вашу фамилию: Шаповаленко
# Введите год рождения: 1992
# Геннадий Шаповаленко, 31


# КОММЕНТАРИЙ: PEP 8 — сборник рекомендаций по стилистическому оформлению Python кода — их стоит использовать для большего удобства чтения своего и чужого кода:
#   https://peps.python.org/pep-0008/

# КОММЕНТАРИЙ: наверняка это поможет вам подобрать правильные имена переменным:
#   https://translate.yandex.ru/?source_lang=ru&target_lang=en


# ИТОГ: хорошо — 2/3
