num = input ("Введите число ")

# КОММЕНТАРИЙ: объявление данных переменных можно считать избыточным, если принять во внимание простоту используемых выражений выражений и то, что в дальнейшем каждая из переменных используется только единожды
next_num = int(num) + 1
# ИСПРАВИТЬ: числовые литералы не нуждаются в преобразовании в объект int(исправлено)
previous_num = int(number) - 1

# ИСПОЛЬЗОВАТЬ: альтернативный вариант записи строковых литералов в несколько строчек (только внутри скобок)
print(f"Следующее за числом {num} число: {next_num} \n"
      f"Для числа {num} предыдущее число: {previous_num}")


# ДОБАВИТЬ: результат выполнения программы — в закомментированном виде (исправлено)
# Пример ввода:
    # 20

# Пример вывода:
    # Следующее за числом 20 число: 21
    # Для числа 20 предыдущее число: 19


# ИТОГ: хорошо — 2/3
