num_1 = float(input())
num_2 = float(input())
num_3 = float(input())

sum_num = 0

if num_1 > 0:
    sum_num += num_1
if num_2 > 0:
    sum_num += num_2
if num_3 > 0:
    sum_num += num_3
    
print(sum_num)


# 4
# -22
# 1.5
# 5.5
# ДОБАВИТЬ: результат выполнения программы с собственными данными
# КОММЕНТАРИЙ: примеры ввода и вывода даны, чтобы вы могли себя проверить — а здесь покажите мне, что вы проверили не только на моём примере, но и на собственных данных


# ИТОГ: выполняйте свой код — 2/3
